In [2]:
import pandas as pd
import numpy as np

In [3]:
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [4]:
data

a  1    2.703743
   2    0.622021
   3    0.778204
b  1    0.450443
   3   -0.642432
c  1   -0.145747
   2   -0.549540
d  2    1.643127
   3   -0.795019
dtype: float64

In [5]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [6]:
data['b']

1    0.450443
3   -0.642432
dtype: float64

In [7]:
data['b':'c']

b  1    0.450443
   3   -0.642432
c  1   -0.145747
   2   -0.549540
dtype: float64

In [8]:
data.loc[['b', 'd']]

b  1    0.450443
   3   -0.642432
d  2    1.643127
   3   -0.795019
dtype: float64

In [9]:
data.loc[:, 2]

a    0.622021
c   -0.549540
d    1.643127
dtype: float64

In [10]:
data.unstack()

          1         2         3
a  2.703743  0.622021  0.778204
b  0.450443       NaN -0.642432
c -0.145747 -0.549540       NaN
d       NaN  1.643127 -0.795019

In [11]:
data.unstack().stack()

a  1    2.703743
   2    0.622021
   3    0.778204
b  1    0.450443
   3   -0.642432
c  1   -0.145747
   2   -0.549540
d  2    1.643127
   3   -0.795019
dtype: float64

In [12]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado',],
                              ['Green', 'Red', 'Green']])

In [13]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [14]:
frame.index.names = ['key1', 'key2']

In [15]:
frame.columns.names = ['state', 'color']

In [16]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [19]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10